/***** Програма до лабораторної роботи №5 (стенд EV8031/AVR) *****
*** Робота із зовнішніми перериваннями INT0 та INT1 (кнопки SW15 та SW16) ***
*** При натисканні на будь-яку із кнопок (SW15 або SW16) на відповідному виводі мікроконтролера з'являється логічний "0" ***
*** Переривання INT0 спрацьовує по низькому рівню, а INT1 - по зрізу ***
*** По перериванню INT0 збільшуємо стан змінної-лічильника, який виводиться на лінійку світлодіодів ***
*** За переривання INT1 зменшуємо стан змінної-лічильника, який виводиться на лінійку світлодіодів ***
*** Затримка на оновлення стану світлодіодної лінійки складає 0.5 с ***/

#define F_CPU 7372800L //задаємо частоту кварцу (7,3728 МГц)
#include <avr/io.h>
#include <avr/iom8515.h>
#include <avr/interrupt.h>
#include <util/delay.h>

//#define led_line 0xA006 //визначаємо адресу лінійки світлодіодів у стенді
//адреса правої пари знакомісць статичного семисегментного індикатора
#define stat_7seg_right 0xB000
//адреса регістра керування запаленням/гасінням точок/знакомісць статичного семисегментний індикатора
#define stat_7seg_control 0xA004

//Декларуємо допоміжну змінну - ознаку того, що нам потрібно робити:
//якщо її значення дорівнює 0xFF, то лічильник працює на додавання
//якщо її значення дорівнює 0x00, то лічильник працює на віднімання
//Значення цієї ознаки змінюється в обробнику відповідного переривання
	volatile unsigned char attribute = 0xFF;

//Переривання IRQ0 (по входу INT0)
ISR(INT0_vect){
	attribute = 0xFF; //лічильник повинен лічити вгору
}

//Переривання IRQ1 (по входу INT1)
ISR(INT1_vect){
	attribute = 0x00; //лічильник повинен зупинитися
}

int main(void) {

//встановлюємо вказівник на адресу лінійки світлодіодів
//	volatile unsigned char *p= (unsigned char*) led_line;
//Змінна-лічильник, стан якої і відображається на світлодіодах
	volatile unsigned char dig;
	volatile unsigned char plus;

//встановлюємо вказівник на адресу правої пари знакомісць статичного індикатора
volatile unsigned char* pr = (unsigned char*) stat_7seg_right;
//встановлюємо вказівник на адресу регістра керування статичним індикатором
volatile unsigned char* pc = (unsigned char*) stat_7seg_control;

//Початкова ініціалізація контролера
	ACSR= 1<<ACD; //вимкнення живлення аналогового компаратора
//дозволяємо роботу із зовнішньою пам'яттю і налаштовуємо зовнішні переривання
	MCUCR = 1 << SRE | 0<< ISC11 | 1<< ISC10 | 0<<ISC01 | 0<<ISC00;
//переривання: INT1 викликається по задньому фронту, а INT0 - по низькому рівню

//на відповідних виводах (біти 0, 1 (ISC00, ISC01) та 2, 3 (ISC10, ISC11) скинуто)

	GICR = 1 << INT0 | 1<<INT1; //дозволяємо зовнішні переривання INT0 та INT1

//встановлюємо прапорець глобального дозволу переривань
//у цьому випадку працюватимуть тільки переривання INT0 та INT1
	sei();

	while(1) {//нескінченний цикл

//перевірка значення змінної-ознаки та аналіз подальших дій із лічильником
		if(attribute== 0xFF) {
		dig = 0x00;
		plus = 0x01;
			dig = dig+plus;
		} else {
			dig;
		}
	if (dig == 0x59)
{
	dig = 0x59;
}
//виводимо значення змінної-лічильника 
		* pc= 0x00;
		* pr= dig;
	
//викликаємо затримку на 1 секунду для відображення станів лічильника
		_delay_ms(1000);
	}
	return 0;
}
