#define F_CPU 7372800L //задаємо частоту кварцу (7,3728 МГц)
#include <avr/io.h>
#include <avr/iom8515.h>
#include <util/delay.h>

//адреса регістра даних для знакомісця динамічного семисегментний індикатора
#define dyn_7seg_data 0x8001
//адреса регістра вибору рядків знакосинтезуючого індикатора і управління
//запалюванням знакомісць динамічного семисегментного індикатора
#define synthes_5x7_row_dyn_7seg_control 0x8002
//визначаємо тривалість затримки (як параметр функції затримки),
//тобто час індикації даних на одному знакомісці індикатора
#define waiting 5

int main (void) {

//початкова ініціалізація контролера
//дозволяємо роботу із зовнішньою пам'яттю (звернення до системного контролеру стенду)
	MCUCR = 1 << SRE;
//відключення живлення аналогового компаратора
	ACSR = 1 << ACD;
int count;
//встановлюємо вказівник на адресу регістра даних динамічного індикатора
	volatile unsigned char* pd = (unsigned char *) dyn_7seg_data;
// встановлюємо покажчик на адресу регістра управління динамічним індикатором
	volatile unsigned char* pc = (unsigned char*) synthes_5x7_row_dyn_7seg_control;

	while (1) { //нескінченний цикл
	for(count = 0; count <= 200; count++){ //1 c

		*pd = 0x89; //горять сегменти a d
		*pc = 0x00; //запалюємо крайнє ліве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

}
			for(count = 0; count <= 200; count++){ // 2 c

		*pd = 0xB0; //горять сегменти f e
		*pc = 0x00; //запалюємо крайнє ліве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x89; //горять сегменти a d
		*pc = 0x01; //запалюємо друге зліва знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс


}
	for(count = 0; count <= 200; count++){ //3 c

		*pd = 0xB0; //горять сегменти f e
		*pc = 0x00; //запалюємо крайнє ліве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x89; //горять сегменти a d
		*pc = 0x01; //запалюємо друге зліва знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x89; //горять сегменти a d
		*pc = 0x02; //запалюємо друге справа знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

}
	for(count = 0; count <= 150; count++){ //3 c

		*pd = 0xB0; //горять сегменти f e 
		*pc = 0x00; //запалюємо крайнє ліве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x89; //горять сегменти a d
		*pc = 0x01; //запалюємо друге зліва знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x89; //горять сегменти a d
		*pc = 0x02; //запалюємо друге справа знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x86; //горять сегменти b c
		*pc = 0x03; //запалюємо крайнє праве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс
}
	for(count = 0; count <= 100; count++){ //2 c

		*pd = 0x89; //горять сегменти a d
		*pc = 0x00; //запалюємо крайнє ліве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x86; //горять сегменти b c
		*pc = 0x01; //запалюємо друге зліва знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0xB0; //горять сегменти f e
		*pc = 0x02; //запалюємо друге справа знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс

		*pd = 0x89; //горять сегменти a d
		*pc = 0x03; //запалюємо крайнє праве знакомісце
		_delay_ms (waiting); //викликаємо затримку на 5 мс
}
	_delay_ms (1000); //викликаємо затримку на 1 с
	}
	return 0;
}
