print("Ласкаво просимо до гри камінь, ножиці, папір!")


def game2(a,b):
        p1 = input(" A введіть ваш варіант-> камінь, ножиці, папір: ")
        if p1 == "камінь":
            p1 = 1
        elif p1 == "ножиці":
            p1 = 2
        elif p1 == "папір":
            p1 = 3
        p2 = input(" B введіть ваш варіант-> камінь, ножиці, папір: ")
        if p2 == "камінь":
            p2 = 1
        elif p2 == "ножиці":
            p2 = 2
        elif p2 == "папір":
            p2 = 3
        if p1 == p2:
            print("Нічия!")
            game2(a, b)
        elif p1 == 1 and p2 == 2:
            print("Грвець A переміг!")
        elif p1 == 1 and p2 == 3:
            print("Гравець B переміг!")
        elif p1 == 3 and p2 == 1:
            print("Гравець A переміг!")
        elif p1 == 3 and p2 == 2:
            print("Гравець B переміг!")
        elif p1 == 2 and p2 == 1:
            print("Гравець B переміг!")
        elif p1 == 2 and p2 == 3:
            print("Гравець B переміг!")


def game(p1, p2, p3):
    a = 0
    b = 0
    c = 0
    if p1 == p2 and p1 == p3 and p2 == p3:
        print("Нічия!")
        a = 1
        b = 1
        c = 1
    if (p1 + p2 + p3) == 6:
        print("Каша!")
    if p1 == 1 and p2 == 2:
        a = 1
    if p1 == 1 and p2 == 3:
        b = 1
    if p1 == 3 and p2 == 1:
        a = 1
    if p1 == 3 and p2 == 2:
        b = 1
    if p1 == 2 and p2 == 1:
        b = 1
    if p1 == 2 and p2 == 3:
        b = 1

    if p1 == 1 and p3 == 2:
        a = 1
    if p1 == 1 and p3 == 3:
        c = 1
    if p1 == 3 and p3 == 1:
        a = 1
    if p1 == 3 and p3 == 2:
        c = 1
    if p1 == 2 and p3 == 1:
        c = 1
    if p1 == 2 and p3 == 3:
        a = 1

    if p3 == 1 and p2 == 2:
        c = 1
    if p3 == 1 and p2 == 3:
        b = 1
    if p3 == 3 and p2 == 1:
        c = 1
    if p3 == 3 and p2 == 2:
        b = 1
    if p3 == 2 and p2 == 1:
        b = 1
    if p3 == 2 and p2 == 3:
        с = 1
    if a >= 1:
        print("Гравець A переміг!")
    if b >= 1:
        print("Гравець B переміг!")
    if c >= 1:
        print("Гравець C переміг!")
    if a == 1 and b == 1:
        a = "A"
        b = "B"
        game2(a, b)
    elif a == 1 and c == 1:
        a = "A"
        c = "C"
        game2(a, c)
    elif b == 1 and c == 1:
        b = "B"
        c = "C"
        game2(b, c)


if __name__ == '__main__':
    Гравець_a = input("Гравець A введіть ваш варіант-> камінь, ножиці, папір: ")
    if Гравець_a == "камінь":
        Гравець_a = 1
    elif Гравець_a == "ножиці":
        Гравець_a = 2
    elif Гравець_a == "папір":
        Гравець_a = 3


    Гравець_b = input("Гравець B введіть ваш варіант-> камінь, ножиці, папір: ")
    if Гравець_b == "камінь":
        Гравець_b = 1
    elif Гравець_b == "ножиці":
        Гравець_b = 2
    elif Гравець_b == "папір":
        Гравець_b = 3

    Гравець_c = input("Гравець C введіть ваш варіант-> камінь, ножиці, папір: ")
    if Гравець_c == "камінь":
        Гравець_c = 1
    elif Гравець_c == "ножиці":
        Гравець_c = 2
    elif Гравець_c == "папір":
        Гравець_c = 3

    game(Гравець_a, Гравець_b, Гравець_c)